TsunamiDing/STM32-game-by-C/Exp2/User/main.c
#include "stm32f10x.h"
#include "EIE3810_TFTLCD.h"
#include "EIE3810_Key.h"
#include "EIE3810_LED.h"
#include "EIE3810_Buzzer.h"
#include "EIE3810_USART.h"

void Delay(u32);
void EIE3810_clock_tree_init(void);
void EIE3810_NVIC_SetPriorityGroup(u8 prigroup);
void EIE3810_TIM2_Init(u16 arr, u16 psc);
void EIE3810_TIM4_Init(u16 arr, u16 psc);
void EIE3810_TIM5_Init(u16 arr, u16 psc);
void JOYPAD_Init(void);
void JOYPAD_Delay(u16 t);
void Game2(void);
void GameBall(void);
void GameBall2(void);
void GameBall3(void);
void GameOver(void);
void TIM2_IRQHandler(void);
void TIM4_IRQHandler(void);
void TIM5_IRQHandler(void);
void show_time_bounces(void);
void EIE3810_USART1_EXTIInit(void);
void USART1_IRQHandler(void);
void pauses(void);

void Step1(void);
void Step2(void);
void Step3(void);
void Step4(void);

int main(void)
{
	EIE3810_clock_tree_init();
	EIE3810_TFTLCD_Init();
	EIE3810_Key_Init();
	EIE3810_LED_Init();
	EIE3810_Buzzer_Init();	
	EIE3810_USART1_init(72, 39062);
	EIE3810_TFTLCD_DrawBackground(WHITE);
	Delay(1000000);	
	Step1();
	Delay(1000000);	
	Step2();
	Delay(1000000);	
	Step3();
	Delay(1000000);	
	while(1){;}
}

u32 level = 0;
u32 x1 = 240;      u32 x2 = 240;
u32 ballx = 240;   u32 bally = 769;
u32 ballx2 = 240;  u32 bally2 = 513;
u32 ballx3 = 240;  u32 bally3 = 257;
u32 right = 1;     u32 up = 0;
u32 right2 = 0;    u32 up2 = 0;
u32 right3 = 1;    u32 up3 = 0;

u32 dir;
u32 i = 0;
u32 bounces = 0;
u32 pause = 0;
u32 Key1;
u32 Changed_Key1;	
u32 Start;
u32 Changed_Start;

void Delay(u32 count)
{
	u32 i;
	for (i=0;i<count;i++);
}

void EIE3810_clock_tree_init(void)
{
	u8 PLL=7;
	u8 temp=0;
	RCC->CR |= 0x00010000;
	while(!((RCC->CR>>17)&0x1));
	RCC->CFGR &= 0xFFFDFFFF;
	RCC->CFGR |= 1<<16;
	RCC->CFGR |= PLL<<18;
	RCC->CR |=0x01000000;
	while(!(RCC->CR>>25));
	RCC->CFGR &=0xFFFFFFFE;
	RCC->CFGR |=0x00000002;
	while(temp !=0x02)
	{
		temp=RCC->CFGR>>2;
		temp &= 0x03;
	}	
	RCC->CFGR &= 0xFFFFFC0F;
	RCC->CFGR |= 0x00000400;	
	RCC->CFGR &= 0xFFFFDFFF;
	FLASH->ACR = 0x32;
	RCC->APB1ENR |= 1<<17;
	RCC->APB2ENR |= 1<<14;
}

void EIE3810_USART1_EXTIInit(void)
{
	NVIC->IP[37] =0x95;
	NVIC->ISER[1] |=1<<5;
}

void USART1_IRQHandler(void)//Define the corresponding relation of the received number and the direction
{
	u32 buffer;
	if(USART1->SR &(1<<5))
	{
		buffer=USART1->DR;
		while(1){
		if(buffer==0)
		{
			dir=0;
			EIE3810_TFTLCD_ShowChar2412(198, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(210, 480, 85, RED, WHITE);//U
			EIE3810_TFTLCD_ShowChar2412(222, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(234, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(246, 480, 69, RED, WHITE);//E
			EIE3810_TFTLCD_ShowChar2412(258, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(270, 480, 83, RED, WHITE);//S
			break;
		}
		if(buffer==1)
		{ 
			dir=1;
			EIE3810_TFTLCD_ShowChar2412(198, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(210, 480, 85, RED, WHITE);//U
			EIE3810_TFTLCD_ShowChar2412(222, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(234, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(246, 480, 69, RED, WHITE);//E
			EIE3810_TFTLCD_ShowChar2412(258, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(270, 480, 83, RED, WHITE);//S
			break;
		}
		if(buffer==2)
		{ 
			dir=2;
			EIE3810_TFTLCD_ShowChar2412(198, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(210, 480, 85, RED, WHITE);//U
			EIE3810_TFTLCD_ShowChar2412(222, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(234, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(246, 480, 69, RED, WHITE);//E
			EIE3810_TFTLCD_ShowChar2412(258, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(270, 480, 83, RED, WHITE);//S
			break;
		}
		if(buffer==3)
		{ 
			dir=3;
			EIE3810_TFTLCD_ShowChar2412(198, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(210, 480, 85, RED, WHITE);//U
			EIE3810_TFTLCD_ShowChar2412(222, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(234, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(246, 480, 69, RED, WHITE);//E
			EIE3810_TFTLCD_ShowChar2412(258, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(270, 480, 83, RED, WHITE);//S
			break;
		}
		if(buffer==4)
		{ 
			dir=4;
			EIE3810_TFTLCD_ShowChar2412(198, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(210, 480, 85, RED, WHITE);//U
			EIE3810_TFTLCD_ShowChar2412(222, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(234, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(246, 480, 69, RED, WHITE);//E
			EIE3810_TFTLCD_ShowChar2412(258, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(270, 480, 83, RED, WHITE);//S
			break;
		}
		if(buffer==5)
		{ 
			dir=5;
			EIE3810_TFTLCD_ShowChar2412(198, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(210, 480, 85, RED, WHITE);//U
			EIE3810_TFTLCD_ShowChar2412(222, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(234, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(246, 480, 69, RED, WHITE);//E
			EIE3810_TFTLCD_ShowChar2412(258, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(270, 480, 83, RED, WHITE);//S
			break;
		}
		if(buffer==6)
		{ 
			dir=6;
			EIE3810_TFTLCD_ShowChar2412(198, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(210, 480, 85, RED, WHITE);//U
			EIE3810_TFTLCD_ShowChar2412(222, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(234, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(246, 480, 69, RED, WHITE);//E
			EIE3810_TFTLCD_ShowChar2412(258, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(270, 480, 83, RED, WHITE);//S
			break;
		}
		if(buffer==7)
		{ 
			dir=7;
			EIE3810_TFTLCD_ShowChar2412(198, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(210, 480, 85, RED, WHITE);//U
			EIE3810_TFTLCD_ShowChar2412(222, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(234, 480, 67, RED, WHITE);//C
			EIE3810_TFTLCD_ShowChar2412(246, 480, 69, RED, WHITE);//E
			EIE3810_TFTLCD_ShowChar2412(258, 480, 83, RED, WHITE);//S
			EIE3810_TFTLCD_ShowChar2412(270, 480, 83, RED, WHITE);//S
			break;
		}}
		Delay(20000000);
		Step4();
	}
}


void JOYPAD_Init(void)
{
	RCC->APB2ENR|=1<<3;
	RCC->APB2ENR|=1<<5;
	GPIOB->CRH&=0xFFFF00FF;
	GPIOB->CRH|=0x00003800;
	GPIOB->ODR|=3<<10;
	GPIOD->CRL&=0xFFFF0FFF;
	GPIOD->CRL|=0x00003000;
	GPIOD->ODR|=1<<3;
}

void JOYPAD_Delay(u16 t)
{
	while(t--);
}

u8 JOYPAD_Read(void)
{
	vu8 temp=0;
	u8 t;
	GPIOB->BSRR |= 1<<11;
	Delay(80);
	GPIOB->BSRR |= 1<<27;
	for(t=0;t<8;t++)
	{
		temp>>=1;
		if((((GPIOB->IDR)>>10)&0x01)==0) temp|=0x80;
		GPIOD->BSRR |= (1<<3);
		Delay(80);
		GPIOD->BSRR |=(1<<19);
		Delay(80);
	}
	return temp;
}

void EIE3810_NVIC_SetPriorityGroup(u8 prigroup)
{
	u32 temp1, temp2;
	temp2 = prigroup&0x00000007;
	temp2 <<=8;
	temp1 = SCB->AIRCR;
	temp1 &= 0x0000F8FF;
	temp1 |= 0x05FA0000;
	temp1 |= temp2;
	SCB->AIRCR = temp1;
}

