TsunamiDing/STM32-game-by-C/Exp2/User/main.c
void EIE3810_TIM2_Init(u16 arr, u16 psc)
{
	//TIM2
	RCC->APB1ENR|= 1<<0;
	TIM2->ARR=arr;
	TIM2->PSC=psc;
	TIM2->DIER|=1<<0;
	TIM2->CR1|=0x01;
	NVIC->IP[28]=0x45;
	NVIC->ISER[0]=(1<<28);
}	

void EIE3810_TIM3_Init(u16 arr, u16 psc)
{
	//TIM3
	RCC->APB1ENR|= 1<<1;
	TIM3->ARR=arr;
	TIM3->PSC=psc;
	TIM3->DIER|=1<<0;
	TIM3->CR1|=0x01;
	NVIC->IP[29]=0x45;
	NVIC->ISER[0]=(1<<29);
}	

void EIE3810_TIM4_Init(u16 arr, u16 psc)
{
	//TIM4
	RCC->APB1ENR|= 1<<2;
	TIM4->ARR=arr;
	TIM4->PSC=psc;
	TIM4->DIER|=1<<0;
	TIM4->CR1|=0x01;
	NVIC->IP[30]=0x45;
	NVIC->ISER[0]=(1<<30);
}	

void EIE3810_TIM5_Init(u16 arr, u16 psc)
{
	//TIM5
	RCC->APB1ENR|= 1<<3;
	TIM5->ARR=arr;
	TIM5->PSC=psc;
	TIM5->DIER|=1<<0;
	TIM5->CR1|=0x01;
	NVIC->IP[18]=0x45;
	NVIC->ISER[1]=(1<<18);
}	

void TIM2_IRQHandler(void)
{
	if (TIM2->SR & 1<<0) //Add comments
	{
		if (pause == 0)
		{
			show_time_bounces();
		}
	}
	TIM2->SR &= ~(1<<0); //Add comments
}

void TIM4_IRQHandler(void)
{
	if (TIM4->SR & 1<<0) //Add comments
	{
		Game2();
	}
	TIM4->SR &= ~(1<<0); //Add comments
}

void TIM5_IRQHandler(void)
{
	if (TIM5->SR & 1<<0)
	{
	GameBall();
	GameBall2();
	GameBall3();
	Delay(50000);
	pauses();
	}
	TIM5->SR &= ~(1<<0);
}

void Game2(void)
{
	u8 key = JOYPAD_Read();
	if (pause == 0)
	{
		if (level == 0)
		{	
			EIE3810_TFTLCD_FillRectangle(x2-40,80,0,15,BLACK);	
			
			if ((((key>>6)&1) == 1)&(x2>=40))
			{
				EIE3810_TFTLCD_FillRectangle(x2-40,80,0,15,WHITE);
				x2-=6;
				EIE3810_TFTLCD_FillRectangle(x2-40,80,0,15,BLACK);
				Delay(10000);
			}
			if ((((key>>7)&1) == 1)&(x2<=440))
			{
				EIE3810_TFTLCD_FillRectangle(x2-40,80,0,15,WHITE);
				x2+=6;
				EIE3810_TFTLCD_FillRectangle(x2-40,80,0,15,BLACK);
				Delay(10000);
			}
//---------------------------------------------------------			
			EIE3810_TFTLCD_FillRectangle(x1-40,80,785,15,BLACK);	
			
			if (((((GPIOE->IDR)>>2)&1) == 0)&(x1>=40))
			{
				EIE3810_TFTLCD_FillRectangle(x1-40,80,785,15,WHITE);
				x1-=4;
				EIE3810_TFTLCD_FillRectangle(x1-40,80,785,15,BLACK);
				Delay(10000);
			}
			if (((((GPIOE->IDR)>>4)&1) == 0)&(x1<=440))
			{
				EIE3810_TFTLCD_FillRectangle(x1-40,80,785,15,WHITE);
				x1+=4;
				EIE3810_TFTLCD_FillRectangle(x1-40,80,785,15,BLACK);
				Delay(10000);
			}
		}
	
//Upper are easy level with long pads
//-----------------------------------------------------------------------	
//Following are hard level with short pads

		if (level == 1)
		{	
			EIE3810_TFTLCD_FillRectangle(x2-25,50,0,15,BLACK);	
			
			if ((((key>>6)&1) == 1)&(x2>=25))
			{
				EIE3810_TFTLCD_FillRectangle(x2-25,50,0,15,WHITE);
				x2-=6;
				EIE3810_TFTLCD_FillRectangle(x2-25,50,0,15,BLACK);
				Delay(10000);
			}
			if ((((key>>7)&1) == 1)&(x2<=455))
			{
				EIE3810_TFTLCD_FillRectangle(x2-25,50,0,15,WHITE);
				x2+=6;
				EIE3810_TFTLCD_FillRectangle(x2-25,50,0,15,BLACK);
				Delay(10000);
			}
			
			//-------------------------------
			
			EIE3810_TFTLCD_FillRectangle(x1-25,50,785,15,BLACK);	
	
			if (((((GPIOE->IDR)>>2)&1) == 0)&(x1>=25))
			{
				EIE3810_TFTLCD_FillRectangle(x1-25,50,785,15,WHITE);
				x1-=4;
				EIE3810_TFTLCD_FillRectangle(x1-25,50,785,15,BLACK);
				Delay(10000);
			}
			if (((((GPIOE->IDR)>>4)&1) == 0)&(x1<=455))
			{
				EIE3810_TFTLCD_FillRectangle(x1-25,50,785,15,WHITE);
				x1+=4;
				EIE3810_TFTLCD_FillRectangle(x1-25,50,785,15,BLACK);
				Delay(10000);
			}
		}
	}
}

void GameBall(void)
{
	if (ballx <= 15) {right = 1;}
	if (ballx >= 465) {right = 0;}
	if (bally <= 30) {up = 1;}
	if (bally >= 770) {up = 0;}
	
	if ((((ballx-ballx2)*(ballx-ballx2))+((bally-bally2)*(bally-bally2)))<=225)
	{
		if (right==1){right=0;}
		if (right==0){right=1;}
		if (up==1){up=0;}
		if (up==0){up=1;}
	}
	
	if ((((ballx-ballx3)*(ballx-ballx3))+((bally-bally3)*(bally-bally3)))<=225)
	{
		if (right==1){right=0;}
		if (right==0){right=1;}
		if (up==1){up=0;}
		if (up==0){up=1;}
	}

	if (pause == 0)
	{
	if(dir == 0)
	{
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,WHITE);
		if(right == 1)
			{ballx++;}
		if(right == 0)
			{ballx--;}
		if (up == 1)
			{bally+=2;}
		if (up == 0)
			{bally-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,RED);
	}
	
	if(dir == 1)
	{
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,WHITE);
		if(right == 1)
			{ballx+=2;}
		if(right == 0)
			{ballx-=2;}
		if (up == 1)
			{bally+=2;}
		if (up == 0)
			{bally-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,RED);
	}
	
	if(dir == 2)
	{
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,WHITE);
		if(right == 1)
			{ballx+=3;}
		if(right == 0)
			{ballx-=3;}
		if (up == 1)
			{bally+=2;}
		if (up == 0)
			{bally-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,RED);
	}
	
	if(dir == 3)
	{
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,WHITE);
		if(right == 1)
			{ballx+=4;}
		if(right == 0)
			{ballx-=4;}
		if (up == 1)
			{bally+=2;}
		if (up == 0)
			{bally-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,RED);
	}
	
	if(dir == 4)
	{
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,WHITE);
		if(right == 1)
			{ballx+=5;}
		if(right == 0)
			{ballx-=5;}
		if (up == 1)
			{bally+=2;}
		if (up == 0)
			{bally-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,RED);
	}
	
	if(dir == 5)
	{
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,WHITE);
		if(right == 1)
			{ballx+=6;}
		if(right == 0)
			{ballx-=6;}
		if (up == 1)
			{bally+=2;}
		if (up == 0)
			{bally-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,RED);
	}
	
	if(dir == 6)
	{
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,WHITE);
		if(right == 1)
			{ballx+=7;}
		if(right == 0)
			{ballx-=7;}
		if (up == 1)
			{bally+=2;}
		if (up == 0)
			{bally-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,RED);
	}
	
	if(dir == 7)
	{
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,WHITE);
		if(right == 1)
			{ballx+=8;}
		if(right == 0)
			{ballx-=8;}
		if (up == 1)
			{bally+=2;}
		if (up == 0)
			{bally-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx,bally,15,1,RED);
	}
}
	
	if(level==0)
	{
		if ((bally <= 30)&((ballx<x2-40)|(ballx>x2+40)))
			{GameOver();bally = 100;}	
		if ((bally >= 770)&((ballx<x1-40)|(ballx>x1+40)))
			{GameOver();bally = 100;}	
	}	
	
	if(level==1)
	{
		if ((bally <= 30)&((ballx<x2-25)|(ballx>x2+25)))
			{GameOver();bally = 100;}	
		if ((bally >= 770)&((ballx<x1-25)|(ballx>x1+25)))
			{GameOver();bally = 100;}	
	}

		if ((ballx <= 15)|(ballx >= 465)|(bally <= 30)|(bally >= 770))
		{
			GPIOB->BSRR = 1<<8;
			Delay(10000);
			GPIOB->BRR = 1<<8;
		}
}

void GameBall2(void)//The second ball with different direction
{
	if (ballx2 <= 15) {right2 = 1;}
	if (ballx2 >= 465) {right2 = 0;}
	if (bally2 <= 30) {up2 = 1;}
	if (bally2 >= 770) {up2 = 0;}

	if ((((ballx-ballx2)*(ballx-ballx2))+((bally-bally2)*(bally-bally2)))<=225)
	{
		if (right2==1){right2=0;}
		if (right2==0){right2=1;}
		if (up2==1){up2=0;}
		if (up2==0){up2=1;}
	}
	
	if ((((ballx3-ballx2)*(ballx3-ballx2))+((bally3-bally2)*(bally3-bally2)))<=225)
	{
		if (right2==1){right2=0;}
		if (right2==0){right2=1;}
		if (up2==1){up2=0;}
		if (up2==0){up2=1;}
	}
	
	if (pause == 0)
	{
	if(dir == 4)
	{
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,WHITE);
		if(right2 == 1)
			{ballx2++;}
		if(right2 == 0)
			{ballx2--;}
		if (up2 == 1)
			{bally2+=2;}
		if (up2 == 0)
			{bally2-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,RED);
	}
	
