TsunamiDing/STM32-game-by-C/Exp2/User/main.c
	if(dir == 5)
	{
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,WHITE);
		if(right2 == 1)
			{ballx2+=2;}
		if(right2 == 0)
			{ballx2-=2;}
		if (up2 == 1)
			{bally2+=2;}
		if (up2 == 0)
			{bally2-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,RED);
	}
	
	if(dir == 6)
	{
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,WHITE);
		if(right2 == 1)
			{ballx2+=3;}
		if(right2 == 0)
			{ballx2-=3;}
		if (up2 == 1)
			{bally2+=2;}
		if (up2 == 0)
			{bally2-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,RED);
	}
	
	if(dir == 7)
	{
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,WHITE);
		if(right2 == 1)
			{ballx2+=4;}
		if(right2 == 0)
			{ballx2-=4;}
		if (up2 == 1)
			{bally2+=2;}
		if (up2 == 0)
			{bally2-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,RED);
	}
	
	if(dir == 0)
	{
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,WHITE);
		if(right2 == 1)
			{ballx2+=5;}
		if(right2 == 0)
			{ballx2-=5;}
		if (up2 == 1)
			{bally2+=2;}
		if (up2 == 0)
			{bally2-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,RED);
	}
	
	if(dir == 1)
	{
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,WHITE);
		if(right2 == 1)
			{ballx2+=6;}
		if(right2 == 0)
			{ballx2-=6;}
		if (up2 == 1)
			{bally2+=2;}
		if (up2 == 0)
			{bally2-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,RED);
	}
	
	if(dir == 2)
	{
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,WHITE);
		if(right2 == 1)
			{ballx2+=7;}
		if(right2 == 0)
			{ballx2-=7;}
		if (up2 == 1)
			{bally2+=2;}
		if (up2 == 0)
			{bally2-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,RED);
	}
	
	if(dir == 3)
	{
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,WHITE);
		if(right2 == 1)
			{ballx2+=8;}
		if(right2 == 0)
			{ballx2-=8;}
		if (up2 == 1)
			{bally2+=2;}
		if (up2 == 0)
			{bally2-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx2,bally2,15,1,RED);
	}
}
	
	if(level==0)
	{
		if ((bally2 <= 30)&((ballx2<x2-40)|(ballx2>x2+40)))
			{GameOver();bally2 = 100;}	
		if ((bally2 >= 770)&((ballx2<x1-40)|(ballx2>x1+40)))
			{GameOver();bally2 = 100;}	
	}	
	
	if(level==1)
	{
		if ((bally2 <= 30)&((ballx2<x2-25)|(ballx2>x2+25)))
			{GameOver();bally2 = 100;}	
		if ((bally2 >= 770)&((ballx2<x1-25)|(ballx2>x1+25)))
			{GameOver();bally2 = 100;}	
	}

		if ((ballx2 <= 15)|(ballx2 >= 465)|(bally2 <= 30)|(bally2 >= 770))
		{
			GPIOB->BSRR = 1<<8;
			Delay(10000);
			GPIOB->BRR = 1<<8;
		}
}

void GameBall3(void)//The third ball with different direction

{
	if (ballx3 <= 15) {right3 = 1;}
	if (ballx3 >= 465) {right3 = 0;}
	if (bally3 <= 30) {up3 = 1;}
	if (bally3 >= 770) {up3 = 0;}

	if ((((ballx3-ballx2)*(ballx3-ballx2))+((bally3-bally2)*(bally3-bally2)))<=225)
	{
		if (right3==1){right3=0;}
		if (right3==0){right3=1;}
		if (up3==1){up3=0;}
		if (up3==0){up3=1;}
	}
	
	if ((((ballx3-ballx)*(ballx3-ballx))+((bally3-bally)*(bally3-bally)))<=225)
	{
		if (right3==1){right3=0;}
		if (right3==0){right3=1;}
		if (up3==1){up3=0;}
		if (up3==0){up3=1;}
	}
	
	if (pause == 0)
	{
	if(dir == 2)
	{
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,WHITE);
		if(right3 == 1)
			{ballx3++;}
		if(right3 == 0)
			{ballx3--;}
		if (up3 == 1)
			{bally3+=2;}
		if (up3 == 0)
			{bally3-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,RED);
	}
	
	if(dir == 3)
	{
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,WHITE);
		if(right3 == 1)
			{ballx3+=2;}
		if(right3 == 0)
			{ballx3-=2;}
		if (up3 == 1)
			{bally3+=2;}
		if (up3 == 0)
			{bally3-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,RED);
	}
	
	if(dir == 4)
	{
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,WHITE);
		if(right3 == 1)
			{ballx3+=3;}
		if(right3 == 0)
			{ballx3-=3;}
		if (up3 == 1)
			{bally3+=2;}
		if (up3 == 0)
			{bally3-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,RED);
	}
	
	if(dir == 5)
	{
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,WHITE);
		if(right3 == 1)
			{ballx3+=4;}
		if(right3 == 0)
			{ballx3-=4;}
		if (up3 == 1)
			{bally3+=2;}
		if (up3 == 0)
			{bally3-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,RED);
	}
	
	if(dir == 6)
	{
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,WHITE);
		if(right3 == 1)
			{ballx3+=5;}
		if(right3 == 0)
			{ballx3-=5;}
		if (up3 == 1)
			{bally3+=2;}
		if (up3 == 0)
			{bally3-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,RED);
	}
	
	if(dir == 7)
	{
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,WHITE);
		if(right3 == 1)
			{ballx3+=6;}
		if(right3 == 0)
			{ballx3-=6;}
		if (up3 == 1)
			{bally3+=2;}
		if (up3 == 0)
			{bally3-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,RED);
	}
	
	if(dir == 0)
	{
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,WHITE);
		if(right3 == 1)
			{ballx3+=7;}
		if(right3 == 0)
			{ballx3-=7;}
		if (up3 == 1)
			{bally3+=2;}
		if (up3 == 0)
			{bally3-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,RED);
	}
	
	if(dir == 1)
	{
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,WHITE);
		if(right3 == 1)
			{ballx3+=8;}
		if(right3 == 0)
			{ballx3-=8;}
		if (up3 == 1)
			{bally3+=2;}
		if (up3 == 0)
			{bally3-=2;}
		EIE3810_TFTLCD_DrawCircle(ballx3,bally3,15,1,RED);
	}
}
	
	if(level==0)
	{
		if ((bally3 <= 30)&((ballx3<x2-40)|(ballx3>x2+40)))
			{GameOver();bally3 = 100;}	
		if ((bally3 >= 770)&((ballx3<x1-40)|(ballx3>x1+40)))
			{GameOver();bally3 = 100;}	
	}	
	
	if(level==1)
	{
		if ((bally3 <= 30)&((ballx3<x2-25)|(ballx3>x2+25)))
			{GameOver();bally3 = 100;}	
		if ((bally3 >= 770)&((ballx3<x1-25)|(ballx3>x1+25)))
			{GameOver();bally3 = 100;}	
	}

		if ((ballx3 <= 15)|(ballx3 >= 465)|(bally3 <= 30)|(bally3 >= 770))
		{
			GPIOB->BSRR = 1<<8;
			Delay(10000);
			GPIOB->BRR = 1<<8;
		}
}
void show_time_bounces(void)
{
	EIE3810_TFTLCD_ShowChar2412(10, 300, 116, RED, WHITE);//t
	EIE3810_TFTLCD_ShowChar2412(22, 300, 105, RED, WHITE);//i
	EIE3810_TFTLCD_ShowChar2412(34, 300, 109, RED, WHITE);//m
	EIE3810_TFTLCD_ShowChar2412(46, 300, 101, RED, WHITE);//e
	EIE3810_TFTLCD_ShowChar2412(58, 300, 58, RED, WHITE);//:
	
	EIE3810_TFTLCD_ShowChar2412(82, 300, 109, RED, WHITE);//m
	EIE3810_TFTLCD_ShowChar2412(118, 300, 115, RED, WHITE);//s	
	
	EIE3810_TFTLCD_ShowChar2412(10, 324, 98, RED, WHITE);//b
	EIE3810_TFTLCD_ShowChar2412(22, 324, 111, RED, WHITE);//o
	EIE3810_TFTLCD_ShowChar2412(34, 324, 117, RED, WHITE);//u
	EIE3810_TFTLCD_ShowChar2412(46, 324, 110, RED, WHITE);//n
	EIE3810_TFTLCD_ShowChar2412(58, 324, 99, RED, WHITE);//c
	EIE3810_TFTLCD_ShowChar2412(70, 324, 101, RED, WHITE);//e
	EIE3810_TFTLCD_ShowChar2412(82, 324, 115, RED, WHITE);//s	
	EIE3810_TFTLCD_ShowChar2412(94, 324, 58, RED, WHITE);//:
	
	EIE3810_TFTLCD_ShowChar2412(70, 300, (i/60)+48, RED, WHITE);//min		
	EIE3810_TFTLCD_ShowChar2412(94, 300, ((i%60)/10)+48, RED, WHITE);//second1
	EIE3810_TFTLCD_ShowChar2412(106, 300, (i%10)+48, RED, WHITE);//second2
	i++;
	
	if ((bally <= 40)|(bally >= 760)|(bally2 <= 40)|(bally2 >= 760)|(bally3 <= 40)|(bally3 >= 760))
	{
		bounces++;
	}
	EIE3810_TFTLCD_ShowChar2412(106, 324, (bounces/10)+48, RED, WHITE);//bounces1
	EIE3810_TFTLCD_ShowChar2412(118, 324, (bounces%10)+48, RED, WHITE);//bounces2
}

void GameOver(void)
{
	pause = 100;

	Delay(1000000);
	EIE3810_TFTLCD_FillRectangle(0,480,0,800,BLACK);
	EIE3810_TFTLCD_ShowChar2412(186, 300, 71, RED, BLACK );//G
	EIE3810_TFTLCD_ShowChar2412(198, 300, 65, RED, BLACK);//A
	EIE3810_TFTLCD_ShowChar2412(210, 300, 77, RED, BLACK);//M
	EIE3810_TFTLCD_ShowChar2412(222, 300, 69, RED, BLACK);//E
	EIE3810_TFTLCD_ShowChar2412(234, 300, 32, RED, BLACK);// 
	EIE3810_TFTLCD_ShowChar2412(246, 300, 79, RED, BLACK);//O	
	EIE3810_TFTLCD_ShowChar2412(258, 300, 86, RED, BLACK);//V	
	EIE3810_TFTLCD_ShowChar2412(270, 300, 69, RED, BLACK);//E	
	EIE3810_TFTLCD_ShowChar2412(282, 300, 82, RED, BLACK);//R	
	
		EIE3810_TFTLCD_ShowChar2412(150, 400, 80, RED, BLACK );//P
		EIE3810_TFTLCD_ShowChar2412(162, 400, 108, RED, BLACK );//l
		EIE3810_TFTLCD_ShowChar2412(174, 400, 97, RED, BLACK );//a
		EIE3810_TFTLCD_ShowChar2412(186, 400, 121, RED, BLACK );//y
		EIE3810_TFTLCD_ShowChar2412(198, 400, 101, RED, BLACK );//e
		EIE3810_TFTLCD_ShowChar2412(210, 400, 114, RED, BLACK );//r
		EIE3810_TFTLCD_ShowChar2412(222, 400, 32, RED, BLACK );// 
		EIE3810_TFTLCD_ShowChar2412(246, 400, 32, RED, BLACK );// 
		EIE3810_TFTLCD_ShowChar2412(258, 400, 108, RED, BLACK );//l
		EIE3810_TFTLCD_ShowChar2412(270, 400, 111, RED, BLACK );//o
		EIE3810_TFTLCD_ShowChar2412(282, 400, 115, RED, BLACK );//s
		EIE3810_TFTLCD_ShowChar2412(294, 400, 101, RED, BLACK );//e
		EIE3810_TFTLCD_ShowChar2412(306, 400, 115, RED, BLACK );//s
		EIE3810_TFTLCD_ShowChar2412(318, 400, 33, RED, BLACK );//!	
	
	if ((bally<=770)|(bally2<=770)|(bally3<=770))
	{
		EIE3810_TFTLCD_ShowChar2412(234, 400, 65, RED, BLACK );//A
	}
	
	if ((bally<=30)|(bally2<=30)|(bally3<=30))
	{
		EIE3810_TFTLCD_ShowChar2412(234, 400, 66, RED, BLACK );//B
	}
}

