TsunamiDing/STM32-game-by-C/Exp2/User/main.c
void Step1(void)
{
	EIE3810_TFTLCD_ShowChar2412(100, 100, 87, WHITE, BLUE);//W
	EIE3810_TFTLCD_ShowChar2412(112, 100, 101, WHITE, BLUE);//e
	EIE3810_TFTLCD_ShowChar2412(124, 100, 108, WHITE, BLUE);//l
	EIE3810_TFTLCD_ShowChar2412(136, 100, 99, WHITE, BLUE);//c
	EIE3810_TFTLCD_ShowChar2412(148, 100, 111, WHITE, BLUE);//o
	EIE3810_TFTLCD_ShowChar2412(160, 100, 109, WHITE, BLUE);//m
	EIE3810_TFTLCD_ShowChar2412(172, 100, 101, WHITE, BLUE);//e
	EIE3810_TFTLCD_ShowChar2412(184, 100, 32, WHITE, BLUE);// 
	EIE3810_TFTLCD_ShowChar2412(196, 100, 116, WHITE, BLUE);//t
	EIE3810_TFTLCD_ShowChar2412(208, 100, 111, WHITE, BLUE);//o
	EIE3810_TFTLCD_ShowChar2412(220, 100, 32, WHITE, BLUE);//
	EIE3810_TFTLCD_ShowChar2412(232, 100, 109, WHITE, BLUE);//m
	EIE3810_TFTLCD_ShowChar2412(244, 100, 105, WHITE, BLUE);//i
	EIE3810_TFTLCD_ShowChar2412(256, 100, 110, WHITE, BLUE);//n
	EIE3810_TFTLCD_ShowChar2412(268, 100, 105, WHITE, BLUE);//i
	EIE3810_TFTLCD_ShowChar2412(280, 100, 32, WHITE, BLUE);// 
	EIE3810_TFTLCD_ShowChar2412(292, 100, 80, WHITE, BLUE);//P
	EIE3810_TFTLCD_ShowChar2412(304, 100, 114, WHITE, BLUE);//r
	EIE3810_TFTLCD_ShowChar2412(316, 100, 111, WHITE, BLUE);//o
	EIE3810_TFTLCD_ShowChar2412(328, 100, 106, WHITE, BLUE);//j
	EIE3810_TFTLCD_ShowChar2412(340, 100, 101, WHITE, BLUE);//e
	EIE3810_TFTLCD_ShowChar2412(352, 100, 99, WHITE, BLUE);//c
	EIE3810_TFTLCD_ShowChar2412(364, 100, 116, WHITE, BLUE);//t
	EIE3810_TFTLCD_ShowChar2412(376, 100, 33, WHITE, BLUE);//!
	Delay(10000000);	
	EIE3810_TFTLCD_ShowChar1608(100, 180, 84, WHITE, RED);//T
	EIE3810_TFTLCD_ShowChar1608(108, 180, 104, WHITE, RED);//h
	EIE3810_TFTLCD_ShowChar1608(116, 180, 105, WHITE, RED);//i
	EIE3810_TFTLCD_ShowChar1608(124, 180, 115, WHITE, RED);//s
	EIE3810_TFTLCD_ShowChar1608(132, 180, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(140, 180, 105, WHITE, RED);//i
	EIE3810_TFTLCD_ShowChar1608(148, 180, 115, WHITE, RED);//s
	EIE3810_TFTLCD_ShowChar1608(156, 180, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(164, 180, 116, WHITE, RED);//t
	EIE3810_TFTLCD_ShowChar1608(172, 180, 104, WHITE, RED);//h
	EIE3810_TFTLCD_ShowChar1608(180, 180, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(188, 180, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(196, 180, 70, WHITE, RED);//F
	EIE3810_TFTLCD_ShowChar1608(204, 180, 105, WHITE, RED);//i
	EIE3810_TFTLCD_ShowChar1608(212, 180, 110, WHITE, RED);//n
	EIE3810_TFTLCD_ShowChar1608(220, 180, 97, WHITE, RED);//a
	EIE3810_TFTLCD_ShowChar1608(228, 180, 108, WHITE, RED);//l
	EIE3810_TFTLCD_ShowChar1608(236, 180, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(244, 180, 76, WHITE, RED);//L
	EIE3810_TFTLCD_ShowChar1608(252, 180, 97, WHITE, RED);//a
	EIE3810_TFTLCD_ShowChar1608(260, 180, 98, WHITE, RED);//b
	EIE3810_TFTLCD_ShowChar1608(268, 180, 46, WHITE, RED);//.
	Delay(10000000);
	EIE3810_TFTLCD_ShowChar1608(100, 240, 65, WHITE, RED);//A
	EIE3810_TFTLCD_ShowChar1608(108, 240, 114, WHITE, RED);//r
	EIE3810_TFTLCD_ShowChar1608(116, 240, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(124, 240, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(132, 240, 121, WHITE, RED);//y
	EIE3810_TFTLCD_ShowChar1608(140, 240, 111, WHITE, RED);//o
	EIE3810_TFTLCD_ShowChar1608(148, 240, 117, WHITE, RED);//u
	EIE3810_TFTLCD_ShowChar1608(156, 240, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(164, 240, 114, WHITE, RED);//r
	EIE3810_TFTLCD_ShowChar1608(172, 240, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(180, 240, 97, WHITE, RED);//a
	EIE3810_TFTLCD_ShowChar1608(188, 240, 100, WHITE, RED);//d
	EIE3810_TFTLCD_ShowChar1608(196, 240, 121, WHITE, RED);//y
	EIE3810_TFTLCD_ShowChar1608(204, 240, 63, WHITE, RED);//?
	Delay(10000000);
	EIE3810_TFTLCD_ShowChar1608(100, 300, 79, WHITE, RED);//O
	EIE3810_TFTLCD_ShowChar1608(108, 300, 75, WHITE, RED);//K
	EIE3810_TFTLCD_ShowChar1608(116, 300, 33, WHITE, RED);//!
	EIE3810_TFTLCD_ShowChar1608(124, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(132, 300, 76, WHITE, RED);//L
	EIE3810_TFTLCD_ShowChar1608(140, 300, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(148, 300, 116, WHITE, RED);//t
	EIE3810_TFTLCD_ShowChar1608(156, 300, 39, WHITE, RED);//'
	EIE3810_TFTLCD_ShowChar1608(164, 300, 115, WHITE, RED);//s
	EIE3810_TFTLCD_ShowChar1608(172, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(180, 300, 115, WHITE, RED);//s
	EIE3810_TFTLCD_ShowChar1608(188, 300, 116, WHITE, RED);//t
	EIE3810_TFTLCD_ShowChar1608(196, 300, 97, WHITE, RED);//a
	EIE3810_TFTLCD_ShowChar1608(204, 300, 114, WHITE, RED);//r
	EIE3810_TFTLCD_ShowChar1608(212, 300, 116, WHITE, RED);//t
	EIE3810_TFTLCD_ShowChar1608(220, 300, 46, WHITE, RED);//.
	Delay(10000000);
	
	EIE3810_TFTLCD_FillRectangle(0,480,0,800,WHITE);
	EIE3810_TFTLCD_ShowChar1608(100, 300, 80, WHITE, RED);//P
	EIE3810_TFTLCD_ShowChar1608(108, 300, 108, WHITE, RED);//l
	EIE3810_TFTLCD_ShowChar1608(116, 300, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(124, 300, 97, WHITE, RED);//a
	EIE3810_TFTLCD_ShowChar1608(132, 300, 115, WHITE, RED);//s
	EIE3810_TFTLCD_ShowChar1608(140, 300, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(148, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(156, 300, 115, WHITE, RED);//s
	EIE3810_TFTLCD_ShowChar1608(164, 300, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(172, 300, 108, WHITE, RED);//l
	EIE3810_TFTLCD_ShowChar1608(180, 300, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(188, 300, 99, WHITE, RED);//c
	EIE3810_TFTLCD_ShowChar1608(196, 300, 116, WHITE, RED);//t
	EIE3810_TFTLCD_ShowChar1608(204, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(212, 300, 116, WHITE, RED);//t
	EIE3810_TFTLCD_ShowChar1608(220, 300, 104, WHITE, RED);//h
	EIE3810_TFTLCD_ShowChar1608(228, 300, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(236, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(244, 300, 100, WHITE, RED);//d
	EIE3810_TFTLCD_ShowChar1608(252, 300, 105, WHITE, RED);//i
	EIE3810_TFTLCD_ShowChar1608(260, 300, 102, WHITE, RED);//f
	EIE3810_TFTLCD_ShowChar1608(268, 300, 102, WHITE, RED);//f
	EIE3810_TFTLCD_ShowChar1608(276, 300, 105, WHITE, RED);//i
	EIE3810_TFTLCD_ShowChar1608(284, 300, 99, WHITE, RED);//c
	EIE3810_TFTLCD_ShowChar1608(292, 300, 117, WHITE, RED);//u
	EIE3810_TFTLCD_ShowChar1608(300, 300, 108, WHITE, RED);//l
	EIE3810_TFTLCD_ShowChar1608(308, 300, 116, WHITE, RED);//t
	EIE3810_TFTLCD_ShowChar1608(316, 300, 121, WHITE, RED);//y
	EIE3810_TFTLCD_ShowChar1608(324, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(332, 300, 108, WHITE, RED);//l
	EIE3810_TFTLCD_ShowChar1608(340, 300, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(348, 300, 118, WHITE, RED);//v
	EIE3810_TFTLCD_ShowChar1608(356, 300, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(364, 300, 108, WHITE, RED);//l
	EIE3810_TFTLCD_ShowChar1608(372, 300, 58, WHITE, RED);//:

	EIE3810_TFTLCD_ShowChar1608(100, 350, 69, WHITE, BLUE);//E
	EIE3810_TFTLCD_ShowChar1608(108, 350, 97, WHITE, BLUE);//a
	EIE3810_TFTLCD_ShowChar1608(116, 350, 115, WHITE, BLUE);//s
	EIE3810_TFTLCD_ShowChar1608(124, 350, 121, WHITE, BLUE);//y
	
