TsunamiDing/STM32-game-by-C/Exp2/User/main.c
	EIE3810_TFTLCD_ShowChar1608(100, 400, 72, BLUE, WHITE);//H
	EIE3810_TFTLCD_ShowChar1608(108, 400, 97, BLUE, WHITE);//a
	EIE3810_TFTLCD_ShowChar1608(116, 400, 114, BLUE, WHITE);//r
	EIE3810_TFTLCD_ShowChar1608(124, 400, 100, BLUE, WHITE);//d
	
	EIE3810_TFTLCD_ShowChar1608(100, 450, 80, WHITE, RED);//P
	EIE3810_TFTLCD_ShowChar1608(108, 450, 114, WHITE, RED);//r
	EIE3810_TFTLCD_ShowChar1608(116, 450, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(124, 450, 115, WHITE, RED);//s
	EIE3810_TFTLCD_ShowChar1608(132, 450, 115, WHITE, RED);//s
	EIE3810_TFTLCD_ShowChar1608(140, 450, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(148, 450, 75, WHITE, RED);//K
	EIE3810_TFTLCD_ShowChar1608(156, 450, 69, WHITE, RED);//E
	EIE3810_TFTLCD_ShowChar1608(164, 450, 89, WHITE, RED);//Y
	EIE3810_TFTLCD_ShowChar1608(172, 450, 48, WHITE, RED);//0
	EIE3810_TFTLCD_ShowChar1608(180, 450, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(188, 450, 116, WHITE, RED);//t
	EIE3810_TFTLCD_ShowChar1608(196, 450, 111, WHITE, RED);//o
	EIE3810_TFTLCD_ShowChar1608(204, 450, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar1608(212, 450, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(220, 450, 110, WHITE, RED);//n
	EIE3810_TFTLCD_ShowChar1608(228, 450, 116, WHITE, RED);//t
	EIE3810_TFTLCD_ShowChar1608(236, 450, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar1608(244, 450, 114, WHITE, RED);//r
	EIE3810_TFTLCD_ShowChar1608(252, 450, 46, WHITE, RED);//.
}

void Step2(void)
{
	u32 Key0;
	u32 Key1;
	u32 Changed_Key1;
	u32 Key_up;
	u32 Changed_Key_up;

	while(1) //use trigger to choose the hard level of the game in a while(a) loop
	{	
		Key0 = (GPIOE->IDR&GPIO_Pin_4);
		Key1 = (GPIOE->IDR&GPIO_Pin_3);
		Key_up = (GPIOA->IDR&GPIO_Pin_0);
		Delay (500000);

		Changed_Key1 = (GPIOE->IDR&GPIO_Pin_3);
		if (Changed_Key1 == 0)
		{
			if (Changed_Key1 < Key1)
			{ 
					if (level == 0)
					{
						level++;
						EIE3810_TFTLCD_FillRectangle(100,32,350,58,WHITE);
						EIE3810_TFTLCD_ShowChar1608(100, 350, 69, BLUE, WHITE);//E
						EIE3810_TFTLCD_ShowChar1608(108, 350, 97, BLUE, WHITE);//a
						EIE3810_TFTLCD_ShowChar1608(116, 350, 115, BLUE, WHITE);//s
						EIE3810_TFTLCD_ShowChar1608(124, 350, 121, BLUE, WHITE);//y

						EIE3810_TFTLCD_ShowChar1608(100, 400, 72, WHITE, BLUE);//H
						EIE3810_TFTLCD_ShowChar1608(108, 400, 97, WHITE, BLUE);//a
						EIE3810_TFTLCD_ShowChar1608(116, 400, 114, WHITE, BLUE);//r
						EIE3810_TFTLCD_ShowChar1608(124, 400, 100, WHITE, BLUE);//d
					}
			}
		}
		Changed_Key_up = (GPIOA->IDR&GPIO_Pin_0);
		
		if (Changed_Key_up == GPIO_Pin_0)
		{
			if (Key_up < Changed_Key_up)
			{
					if (level == 1)
					{
						level--;
						EIE3810_TFTLCD_FillRectangle(100,32,350,58,WHITE);
						EIE3810_TFTLCD_ShowChar1608(100, 350, 69, WHITE, BLUE);//E
						EIE3810_TFTLCD_ShowChar1608(108, 350, 97, WHITE, BLUE);//a
						EIE3810_TFTLCD_ShowChar1608(116, 350, 115, WHITE, BLUE);//s
						EIE3810_TFTLCD_ShowChar1608(124, 350, 121, WHITE, BLUE);//y

						EIE3810_TFTLCD_ShowChar1608(100, 400, 72, BLUE, WHITE);//H
						EIE3810_TFTLCD_ShowChar1608(108, 400, 97, BLUE, WHITE);//a
						EIE3810_TFTLCD_ShowChar1608(116, 400, 114, BLUE, WHITE);//r
						EIE3810_TFTLCD_ShowChar1608(124, 400, 100, BLUE, WHITE);//d
					}
			}
		}
		
		if (Key0 == 0)
		{
			break;
		}
	}
}

void Step3(void)
{	
	EIE3810_TFTLCD_FillRectangle(0,480,0,800,WHITE);
	EIE3810_TFTLCD_ShowChar2412(42, 300, 85, WHITE, RED);//U
	EIE3810_TFTLCD_ShowChar2412(54, 300, 115, WHITE, RED);//s
	EIE3810_TFTLCD_ShowChar2412(66, 300, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar2412(78, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar2412(90, 300, 85, WHITE, RED);//U
	EIE3810_TFTLCD_ShowChar2412(102, 300, 83, WHITE, RED);//S
	EIE3810_TFTLCD_ShowChar2412(114, 300, 65, WHITE, RED);//A
	EIE3810_TFTLCD_ShowChar2412(126, 300, 82, WHITE, RED);//R
	EIE3810_TFTLCD_ShowChar2412(138, 300, 84, WHITE, RED);//T
	EIE3810_TFTLCD_ShowChar2412(150, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar2412(162, 300, 102, WHITE, RED);//f
	EIE3810_TFTLCD_ShowChar2412(174, 300, 111, WHITE, RED);//o
	EIE3810_TFTLCD_ShowChar2412(186, 300, 114, WHITE, RED);//r
	EIE3810_TFTLCD_ShowChar2412(198, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar2412(210, 300, 97, WHITE, RED);//a
	EIE3810_TFTLCD_ShowChar2412(222, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar2412(234, 300, 114, WHITE, RED);//r
	EIE3810_TFTLCD_ShowChar2412(246, 300, 97, WHITE, RED);//a
	EIE3810_TFTLCD_ShowChar2412(258, 300, 110, WHITE, RED);//n
	EIE3810_TFTLCD_ShowChar2412(270, 300, 100, WHITE, RED);//d
	EIE3810_TFTLCD_ShowChar2412(282, 300, 111, WHITE, RED);//o
	EIE3810_TFTLCD_ShowChar2412(294, 300, 109, WHITE, RED);//m
	EIE3810_TFTLCD_ShowChar2412(306, 300, 32, WHITE, RED);// 
	EIE3810_TFTLCD_ShowChar2412(318, 300, 100, WHITE, RED);//d
	EIE3810_TFTLCD_ShowChar2412(330, 300, 105, WHITE, RED);//i
	EIE3810_TFTLCD_ShowChar2412(342, 300, 114, WHITE, RED);//r
	EIE3810_TFTLCD_ShowChar2412(354, 300, 101, WHITE, RED);//e
	EIE3810_TFTLCD_ShowChar2412(366, 300, 99, WHITE, RED);//c
	EIE3810_TFTLCD_ShowChar2412(378, 300, 116, WHITE, RED);//t
	EIE3810_TFTLCD_ShowChar2412(390, 300, 105, WHITE, RED);//i
	EIE3810_TFTLCD_ShowChar2412(402, 300, 111, WHITE, RED);//o
	EIE3810_TFTLCD_ShowChar2412(414, 300, 110, WHITE, RED);//n
	EIE3810_TFTLCD_ShowChar2412(426, 300, 46, WHITE, RED);//.
	EIE3810_USART1_EXTIInit();
  USART1_IRQHandler();
}

void Step4(void)
{
	EIE3810_TFTLCD_FillRectangle(0,480,0,800,WHITE);
	
	EIE3810_TFTLCD_FillRectangle(202,75,330,140,WHITE);
	EIE3810_TFTLCD_SevenSegment(202, 330, 3, RED);
	Delay(10000000);	
	
	EIE3810_TFTLCD_FillRectangle(202,75,330,140,WHITE);
	EIE3810_TFTLCD_SevenSegment(202, 330, 2, RED);
	Delay(10000000);
	
	EIE3810_TFTLCD_FillRectangle(202,75,330,140,WHITE);
	EIE3810_TFTLCD_SevenSegment(202, 330, 1, RED);
	Delay(10000000);	
	
	EIE3810_TFTLCD_FillRectangle(202,75,330,140,WHITE);
	EIE3810_TFTLCD_SevenSegment(202, 330, 0, RED);
	Delay(10000000);
	
	EIE3810_TFTLCD_FillRectangle(0,480,0,800,WHITE);
	
//------------------------------------------------------Initial for the timers that will be used in the game soon
	EIE3810_NVIC_SetPriorityGroup(5);
	JOYPAD_Init();
	EIE3810_TIM2_Init(9999,7199);
	EIE3810_TIM4_Init(499,719);
	EIE3810_TIM5_Init(4999,719);
}

void pauses(void) //use trigger to control the pause of the game
{
	Changed_Key1 = (((GPIOE->IDR)>>3)&1);
	if (Changed_Key1 == 0){
		Delay(100);
		if (Changed_Key1 == 0){
			if (Changed_Key1 < Key1){
				if (pause == 0){
					pause = 1;}
				else	
					pause = 0;}}}
	
	Changed_Start = ((JOYPAD_Read()>>3)&1);
	if (Changed_Start == 1){
		Delay(100);
		if (Changed_Start == 1){
			if (Changed_Start > Start){
				if (pause == 0){
					pause = 1;}
				else	
					pause = 0;}}}
	
	Key1 = Changed_Key1;
	Start = Changed_Start;
}
